Repository: yamato/perl6doc-jp
Catalog: tm/auto/S02-bits-20140914.tmx
Source language: en_us
Languages: ja

source: (Marking dynamic variables as readonly is very helpful in terms of sharing the same value among competing threads, since a readonly variable need not be locked.)
ja: （readonlyな変数がロックされる必要がない時から、readonlyであるように、動的変数に跡を残すことは同じ値を競争している糸で分配する観点から非常に役に立つ。）

source: The DYNAMIC pseudo-package is just like CALLER except that it starts in the current dynamic scope and from there scans outward through all dynamic scopes (frames) until it finds a dynamic variable of that name in that dynamic frame's associated lexical pad.
ja: 動的フレームのものが語彙的なパッドを結びつけたという点でそれがその名前の動的変数を見つけるまでそれが現在の動的スコープで始まって、そこからすべての動的スコープ（フレーム）で外へざっと目を通すこと以外は、DYNAMIC擬似パッケージはちょうどCALLERのようである。

source: (This search is implied for variables with the * twigil;
ja: （この検索は、* twigilで変数のために意味される;

source: hence $*FOO is equivalent to DYNAMIC::&lt;$*FOO&gt;.) If, after scanning outward through all those dynamic scopes, there is no variable of that name in any immediately associated lexical pad, it strips the * twigil out of the name and looks in the GLOBAL package followed by the PROCESS package.
ja: それゆえに、$*FOOはDYNAMIC::&lt;$*FOO&gt;に等しい。）、外へすべてのそれらの動的スコープを通してのウイルスチェックの後、その名前の変数が何かすぐに関連した語彙的な離着陸場にないならば、それは名前から* twigilをむいて、PROCESSパッケージが続くGLOBALパッケージをのぞく。

source: If the value is not found, it returns failure.
ja: 値が見つからないならば、それは失敗を返る。

source: Unlike CALLER, DYNAMIC will see a dynamic variable that is declared in the current scope, since it starts search 0 scopes up the stack rather than 1.
ja: CALLERとは異なり、DYNAMICは現在のスコープで宣言される動的変数を見る、それが始まる時から、1よりもむしろスタックの上で0のスコープを捜しなさい。

source: You may, however, use CALLER::&lt;$*foo&gt; to bypass a dynamic definition of $*foo in your current scope, such as to initialize it with the outer dynamic value:
ja: しかし、例えば外のダイナミックな値でそれを初期化するために、あなたは、現在のスコープで$*fooのダイナミックな定義を迂回するために、CALLER::&lt;$*foo&gt;を使うかもしれない：

source: The temp declarator may be used (without an initializer) on a dynamic variable to perform a similar operation:
ja: temp宣言が、類似した演算を実行するために、動的変数で使われるかもしれない（イニシャライザなしで）：

source: The main difference is that by default it initializes the new $*foo with its current value, rather than the caller's value.
ja: 主要な違いは、デフォルトで、それが現在の値（発信者の値よりもむしろ）で新しい$*fooを初期化するということである。

source: Also, it is allowed only on read/write dynamic variables, since the only reason to make a copy of the outer value would be because you'd want to override it later and then forget the changes at the end of the current dynamic scope.
ja: また、外の値のコピーを製作する唯一の理由があなたが後でそれにオーバーライドして、それから現在の動的スコープの終わりに変化を忘れたいだろうからである時から、それは読み出し／書き込み動的変数だけで許される。

source: You may also use OUTER::&lt;$*foo&gt; to mean you want to start the search in your outer lexical scope, but this will succeed only if that outer lexical scope also happens to be one of your current dynamic scopes.
ja: あなたは外のレキシカルスコープで検索を始めることを望む平均にOUTER::&lt;$*foo&gt;も使うかもしれない、しかし、その外のレキシカルスコープも偶然あなたの現在の動的スコープの1つであるのの場合だけ、これは成功する。

source: That is, the same search is done as with the bare $*foo, but any &quot;hits&quot; are ignored until we've got to the OUTER scope in our traversal.
ja: つまり、同じ検索は裸の$*fooと同様にされる、しかし、我々が横断においてOUTERスコープに着くまで、何かヒットは無視される。

source: Package lookup
ja: パッケージ検索

source: There is no longer any special package hash such as %Foo::.
ja: %Foo::のようなもはや少しも特別なパッケージハッシュが、ない。

source: Just subscript the package object itself as a hash object, the key of which is the variable name, including any sigil.
ja: ちょうどそれ自体ハッシュオブジェクト（キー）としてのパッケージオブジェクトが変数名（何かシギルを含む）である添え字。

source: The package object can be derived from a type name by use of the :: postfix:
ja: パッケージオブジェクトは、::接尾辞の用法によって、タイプ名に由来することができる：

source: (Directly subscripting the type with either square brackets or curlies is reserved for various generic type-theoretic operations.
ja: （直接、どちらの正方形による型でも括弧に入れる添え字付けまたはcurliesは、いろいろな汎用的な型理論的な演算のために予約である。

source: In most other matters type names and package names are interchangeable.)
ja: 大部分の他の問題では、タイプ名とパッケージ名は、交換可能である。）

source: Typeglobs are gone.
ja: Typeglobsはなくなる。

source: Use binding (:= or ::=) to do aliasing.
ja: エイリアシングをするために、バインディング（:=または::=）を使いなさい。

source: Individual variable objects are still accessible through the hash representing each symbol table, but you have to include the sigil in the variable name now:
ja: 個別変数オブジェクトは各々のシンボルテーブルを表現しているハッシュを通してまだアクセスできる、しかし、あなたは現在シギルを変数名に含めなければならない：

source: MyPackage::'$foo' or the equivalent MyPackage::&lt;$foo&gt;.
ja: MyPackage::'$foo'または等しいMyPackage::&lt;$foo&gt;。

source: Globals
ja: グローバル

source: Interpreter globals live in the GLOBAL package.
ja: GLOBALパッケージの通訳グローバルライブ。

source: The user's program starts in the GLOBAL package, so &quot;our&quot; declarations in the mainline code go into that package by default.
ja: ユーザープログラムはGLOBALパッケージで始まるので、主流をなすコードの&quot;our&quot;宣言はデフォルトでそのパッケージに使われる。

source: Process-wide variables live in the PROCESS package.
ja: プロセスに広がる変数は、PROCESSパッケージで生きる。

source: Most predefined globals such as $*UID and $*PID are actually process globals.
ja: $*UIDのような大部分のあらかじめ定義されたグローバルと$*PIDは、実はプロセスグローバルである。

source: The PROCESS package
ja: PROCESSパッケージ

source: There is only ever a single PROCESS package.
ja: 一つのPROCESSパッケージが、これまでにだけある。

source: For an ordinary Perl program running by itself, there is only one GLOBAL package as well.
ja: 単独で動作している普通のPerlプログラムについては、1つのGLOBALパッケージだけが、同様にある。

source: However, in certain situations (such as shared hosting under a webserver), the actual process may contain multiple virtual processes or interpreters, each running its own &quot;main&quot; code.
ja: しかし、特定の状況（webserverの下でホスティングを共有したようであるもの）では、実加工は複数の仮想過程または通訳を含むかもしれない。そして、各々がそれ自身の&quot;main&quot;コードを実行する。

source: In this case, the GLOBAL namespace holds variables that properly belong to the individual virtual process, while the PROCESS namespace holds variables that properly belong to the actual process as a whole.
ja: この場合、PROCESS名前空間が全体として実加工にきちんと属している変数を持つ間、GLOBAL名前空間は個々の仮想過程にきちんと属している変数を持つ。

source: From the viewpoint of the program there is little difference as long as all global variables are accessed as if they were dynamic variables (by using the * twigil).
ja: まるでそれらが動的変数（* twigilを用いて）であるようにすべてのグローバル変数がアクセスされる限り、プログラムの視点から、五十歩百歩がある。

source: The process as a whole may place restrictions on the mutability of process variables as seen by the individual subprocesses.
ja: 個々のサブプロセスによって見られるように、プロセスは規制をプロセス変数の移り気に全体として置くかもしれない。

source: Also, individual subprocesses may not create new process variables.
ja: また、個々のサブプロセスは、新しいプロセス変数をつくらないかもしれない。

source: If the process wishes to grant subprocesses the ability to communicate via the PROCESS namespace, it must supply a writeable dynamic variable to all the subprocesses granted that privilege.
ja: プロセスがサブプロセスにPROCESS名前空間によって通信する能力を与えることを望むならば、それはその特権を受けるすべてのサブプロセスに書き込み可能な動的変数を供給しなければならない。

source: Dynamic variable creation
ja: 動的変数創造

source: It is illegal to assign or bind a dynamic variable that does not already exist.
ja: すでに存在しない動的変数を割り当てるか、結びつけることは、無効である。

source: It will not be created in GLOBAL (or PROCESS) automatically, nor is it created in any lexical scope.
ja: それは自動的にGLOBAL（またはPROCESS）でつくられないし、それは何かレキシカルスコープでつくられない。

source: Instead, you must assign directly using the package name to get that to work:
ja: その代わりに、あなたは、仕事にそれを得るためにパッケージ名を直接使用することを割り当てなければならない：

source: The magic input handle
ja: マジックの入力ハンドル

source: The magic command-line input handle is $*ARGFILES.
ja: マジックのコマンドライン入力ハンドルは、$*ARGFILESである。

source: The arguments themselves come in @*ARGS.
ja: 引数自体は、@*ARGSで来る。

source: See also &quot;Declaring a MAIN subroutine&quot; in S06.
ja: S06で「主要なサブルーチンを宣言する」こと参照。

source: Magical access to documentation
ja: ドキュメンテーションへの不思議な接近

source: The Pod documentation in a file is accessible from code in the same file via variables with a = secondary sigil.
ja: ファイルのポッドドキュメンテーションは、=第二のシギルで変数を通して同じファイルでコードからアクセスできる。

source: $=data is the accessor for your =data section(s), for instance.
ja: たとえば、$=dataはあなたの=dataセクション(s)のためのアクセッサである。

source: All Pod structures are available as a hierarchical data structure, through $=pod.
ja: $=podを通して、すべてのポッド構造は、階層的なデータ構造として使われる。

source: As with *, the = may also be used as a package name:
ja: *と同様に、=がパッケージ名としても使われるかもしれない：

source: Magical lexically scoped values
ja: 不思議な辞書的に捜し出された値

source: Magical lexically scoped values live in variables with a ? secondary sigil.
ja: 不思議な辞書的に捜し出された値は、?第二のシギルで変数で生きる。

source: These are all values that are known to the compiler, and may in fact be dynamically scoped within the compiler itself, and only appear to be lexically scoped because dynamic scopes of the compiler resolve to lexical scopes of the program.
ja: これらは、コンパイラに知られていて、コンパイラそのものの範囲内で実際ダイナミックに捜し出されるかもしれないすべての値で、コンパイラの動的スコープがプログラムのレキシカルスコープに分解するので辞書的に捜し出されるように見えるだけである。

source: All $? variables are considered constants, and may not be modified after being compiled in. The user is also allowed to define or (redefine) such constants:
ja: すべての$?変数はよく考えた定数で、中で編集された後に修正されるというわけではないかもしれない。ユーザーは限定またはそのような定数（再定義する）にも入ることができる：

source: (Note that the constant declarator always evaluates its initialization expression at compile time.)
ja: （一定の宣言が常にコンパイル時でその初期化表現を評価することに注意すべきである。）

source: $?FILE and $?LINE are your current file and line number, for instance.
ja: たとえば、$?FILEと$?LINEはあなたの現行ファイルと行番号である。

source: Instead of $?OUTER::FOO you probably want to write OUTER::&lt;$?FOO&gt;.
ja: $?OUTER::FOOの代わりに、あなたは多分OUTER::&lt;$?FOO&gt;を書きたいだろう。

source: Within code that is being run during the compile, such as BEGIN blocks, or macro bodies, or constant initializers, the compiler variables must be referred to as (for instance) COMPILING::&lt;$?LINE&gt; if the bare $?LINE would be taken to be the value during the compilation of the currently running code rather than the eventual code of the user's compilation unit.
ja: コード（つまりコンパイルの間の実行、例えばBEGINブロックまたはマクロボディであることまたは恒常的なイニシャライザ）の範囲内で、裸の$?LINEがユーザーのコンパイル単位の最終的なコードよりもむしろ現在実行コードのコンパイルの間の値であるとみなされるならば、コンパイラ変数は（たとえば）COMPILING::&lt;$?LINE&gt;と呼ばれなければならない。

source: For instance, within a macro body $?LINE is the line within the macro body, but COMPILING::&lt;$?LINE&gt; is the line where the macro was invoked.
ja: たとえば、マクロボディの中で、$?LINEはマクロボディの中の線である、しかし、COMPILING::&lt;$?LINE&gt;はマクロが呼び出された線である。

source: See below for more about the COMPILING pseudo package.
ja: COMPILING疑似パッケージについてより多くのために下記参照。

source: Here are some possibilities:
ja: 若干の可能性は、ここにある：

source: The following return objects that contain all pertinent info:
ja: すべての関係する情報を含む以下の戻りオブジェクト：

source: It is relatively easy to smartmatch these constant objects against pairs to check various attributes such as name, version, or authority:
ja: これらの定数がいろいろな属性（例えば名前、バージョンまたは権限）をチェックするために組に対して反対することは、スマートマッチに比較的容易である：

source: Matches of constant pairs on constant objects may all be resolved at compile time, so dead code can be eliminated by the optimizer.
ja: 恒常的なオブジェクトの一定の組のマッチのすべてはコンパイル時で分解されるかもしれないので、不要コードはオプティマイザーによって除かれることができる。

source: Note that some of these things have parallels in the * space at run time:
ja: これらのものの一部が実行時で*スペースに平行を持つことに注意すべきである：

source: You should not assume that these will have the same value as their compile-time cousins.
ja: あなたは、これらが彼らのコンパイル時いとこと同じ値を持つと仮定するべきでない。

source: The COMPILING pseudopackage
ja: COMPILING擬似パッケージ

source: While $? variables are constant to the run time, the compiler has to have a way of changing these values at compile time without getting confused about its own $? variables (which were frozen in when the compile-time code was itself compiled).
ja: $?変数が実行時まで一定の間、コンパイラにはそれ自身の$?変数（コンパイル時コードがそれ自体コンパイルされたとき、凍結した）について混乱したようになることなくコンパイル時でこれらの値を変えることの方法がなければならない。

source: The compiler can talk about these compiler-dynamic values using the COMPILING pseudopackage.
ja: コンパイラは、COMPILING擬似パッケージを用いたこれらのコンパイラダイナミックな値について話すことができる。

source: References to COMPILING variables are automatically hoisted into the lexical scope currently being compiled.
ja: COMPILING変数への言及は、現在編集されているレキシカルスコープに、自動的に上げられる。

source: Setting or temporizing a COMPILING variable sets or temporizes the incipient $? variable in the surrounding lexical scope that is being compiled.
ja: 固まってまたは一時しのぎをする、COMPILING変数は固まる、または、一時しのぎをする編集されている周囲のレキシカルスコープの初期の$?変数。

source: If nothing in the context is being compiled, an exception is thrown.
ja: 前後関係の何も編集されていないならば、例外は投げられる。

source: Note that CALLER::&lt;$?FOO&gt; might discover the same variable as COMPILING::&lt;$?FOO&gt;, but only if the compiling scope is the immediate caller.
ja: CALLER::&lt;$?FOO&gt;がCOMPILING::&lt;$?FOO＞と同じ変数を発見するかもしれない点に、しかし、編集しているスコープが近い発信者である場合だけ、注意しなさい。

source: Likewise OUTER::&lt;$?FOO&gt; might or might not get you to the right place.
ja: 同様に、OUTER::&lt;$?FOO&gt;はあなたを適所に連れて行くかもしれないか、連れて行かないかもしれない。

source: In the abstract, COMPILING::&lt;$?FOO&gt; goes outwards dynamically until it finds a compiling scope, and so is guaranteed to find the &quot;right&quot; $?FOO.
ja: 抽象的に、それが編集しているスコープを見つけるまで、COMPILING::&lt;$?FOO＞はダイナミックに外へ行って、そして、正しい$?FOOを見つけると保証される。

source: (In practice, the compiler hopefully keeps track of its current compiling scope anyway, so no scan is needed.)
ja: （実際には、コンパイラは期待を持って、いずれにしろスコープを編集しているその流れの経過を追うので、走査が必要でない。）

source: Perceptive readers will note that this subsumes various &quot;compiler hints&quot; proposals.
ja: 知覚の鋭い読者は、これがいろいろな「コンパイラヒント」提案を包含する点に注意する。

source: Crazy readers will wonder whether this means you could set an initial value for other lexicals in the compiling scope.
ja: 狂った読者は、あなたがそうすることができたこの手段がスコープを編集する際に初期値を他のlexicalsに設定したかどうか疑問に思う。

source: The answer is yes.
ja: 答えは、はいである。

source: In fact, this mechanism is probably used by the exporter to bind names into the importer's namespace.
ja: 実際、このメカニズムは、輸出者によって輸入業者の名前空間に名前を結びつけるのに多分用いられるだろう。

source: Switching parsers
ja: 切換パーサー

source: The currently compiling Perl parser is switched by modifying one of the braided languages in COMPILING::&lt;%?LANG&gt;.
ja: 現在編集しているPerl構文解析器は、COMPILING::&lt;%?LANG&gt;で編まれた言語の1つを修正することによって変えられる。

source: Lexically scoped parser changes should temporize the modification.
ja: 辞書的に捜し出された構文解析器変化は一時しのぎをしなければならない修正。

source: Changes from here to end-of-compilation unit can just assign or bind it.
ja: ここから編集の終了単位への変化は、ちょうどそれを割り当てることができるか、結びつけることができる。

source: In general, most parser changes involve deriving a new grammar and then pointing one of the COMPILING::&lt;%?LANG&gt; entries at that new grammar.
ja: 一般に、大部分の構文解析器変化は、その新しい文法で新しい文法とそれからCOMPILING::&lt;%?LANG&gt;エントリーのポイントしている一つを引き出すことが必要である。

source: Alternately, the tables driving the current parser can be modified without derivation, but at least one level of anonymous derivation must intervene from the preceding Perl grammar, or you might be messing up someone else's grammar.
ja: あるいは、現在の構文解析器を駆動しているテーブルは起源なしで修正されることができる、しかし、少なくとも1レベルの匿名の起源は前のPerl文法から介入しなければならない、または、あなたは他の誰かの文法をだいなしにしているかもしれない。

source: Basically, the current set of grammars in %?LANG has to belong only to the current compiling scope.
ja: 基本的に、%?LANGの文法書の現在のセットは、スコープを編集している流れだけに属していなければならない。

source: It may not be shared, at least not without explicit consent of all parties.
ja: 少なくともすべての党の明示的同意なしででない、それは共有されないかもしれない。

source: No magical syntax at a distance.
ja: 少し離れた不思議な構文でない。

source: Consent of the governed, and all that.
ja: 支配するもの、その他の同意。

source: Slangs
ja: 俗語

source: Individual sublanguages (&quot;slangs&quot;) may be referred to using the ~ twigil.
ja: 個々の部分言語（「俗語」）は、~ twigilを使うことを参照するかもしれない。

source: The following are useful:
ja: 以下は役に立つ：

source: Hence, when you are defining a normal Perl macro, you're replacing $~MAIN with a derived language, but when you define a new regex backslash sequence, you're replacing $~Regex with a derived language.
ja: それゆえに、通常のPerlマクロを定義しているとき、あなたは$~MAINを派生言語と入れ替えている、しかし、新しい正規表現バックスラッシュシーケンスを定義するとき、あなたは$~Regexを派生言語と入れ替えている。

source: (There may or may not be a syntax in the main language to do this.) Note that such changes are automatically scoped to the lexical scope;
ja: なお、そのような変化は、レキシカルスコープに自動的に捜し出される（構文が、こうするために、主要な言語であるかもしれないか、ないかもしれない。）;

source: as with real slang, the definitions are temporary and embedded in a larger language inherited from the surrounding culture.
ja: 本当の俗語と同様に、定義はテンポラリーで、周囲の文化から受け継がれるより大きな言語に埋め込まれる。

source: Instead of defining macros directly you may also mix in one or more grammar rules by lexically scoped declaration of a new sublanguage:
ja: 直接マクロを定義する代わりに、あなたは新しい部分言語の辞書的に捜し出された宣言によって、一つ以上の文法規則も混ぜるかもしれない：

source: This tends to be more efficient since it only has to do one mixin at the end of the block.
ja: それがブロックの終わりに1つのミキシンをしなければならないだけの時から、これはより効率的な傾向がある。

source: Note that the slang declaration has nothing to do with package Regex, but only with $~Regex.
ja: $~Regexだけで以外、俗語宣言がパッケージRegexとは無関係であることに注意すべきである。

source: Sublanguages are in their own namespace (inside the current value of %?LANG, in fact).
ja: 部分言語は、彼ら自身の名前空間（実際、%?LANGの現在の値の中に）にある。

source: Hence augment is modifying one of the local strands of a braided language, not a package somewhere else.
ja: それゆえに、augmentは編まれた言語（どこかのパッケージでない他に）のローカル要素の1つを修正している。

source: You may also supersede a sublang entirely if, for example, you just want to disable that sublanguage in the current lexical scope:
ja: たとえば、ちょうど現在のレキシカルスコープでその部分言語を働かなくしたいならば、あなたは完全にsublangにも取って代わるかもしれない：

source: If you supersede MAIN then you're replacing the Perl parser entirely.
ja: MAINに取って代わるならば、あなたは完全にPerl構文解析器を交換している。

source: This might be done by, say, the &quot;use COBOL&quot; declaration.
ja: まあ、これは&quot;use COBOL&quot;宣言によってされるかもしれない。

source: Extended identifiers
ja: 拡張識別子

source: It is often convenient to have names that contain arbitrary characters or other data structures.
ja: 任意の文字またはその他のデータ構造を含む名前を持つことは、しばしば便利である。

source: Typically these uses involve situations where a set of entities shares a common &quot;short&quot; name, but still needs for each of its elements to be identifiable individually.
ja: 一般的に、これらの用途は、一組の実体が普通の「短い」名前を共有するが、まだその要素の各々のために個々に定義可能な必要がある状況を含む。

source: For example, you might use a module whose short name is ThatModule, but the complete long name of a module includes its version, naming authority, and perhaps even its source language.
ja: たとえば、あなたは短いファイル名がThatModuleであるモジュールを使用するかもしれない、しかし、モジュールの完全な長い名前はそのバージョン、命名機関とおそらくその起点言語さえ含む。

source: Similarly, sets of operators work together in various syntactic categories with names like prefix, infix, postfix, etc. The long names of these operators, however, often contain characters that are excluded from ordinary identifiers.
ja: 同様に、しかし、演算子の仲間はprefix、infix、postfix、その他のような名前でいろいろな構文法のカテゴリーで一緒にこれらの演算子の長い名前を働かせる。そして、しばしば、通常識別子から除外される文字を含みなさい。

source: For all such uses, an identifier followed by a subscript-like adverbial form (see below) is considered an extended identifier:
ja: すべてのそのような用途（添え字のような副詞形が続く識別子）（下記参照）のために、延長した識別子は考えられる：

source: This name is to be thought of semantically, not syntactically.
ja: この名前は、構文的にでなく、意味論的に、考えられることになっている。

source: That is, the bracketing characters used do not count as part of the name;
ja: つまり、使われる括弧に入れている文字は、名前の一部として数えない;

source: only the quoted data matters.
ja: 引合いに出されたデータ問題だけ。

source: These are all the same name:
ja: これらは、すべての同じ名前である：

source: Despite the appearance as a subscripting form, these names are resolved not at run time but at compile time.
ja: 添え字付けの形としての出演にもかかわらず、これらの名前は、実行時でなくコンパイル時で分解される。

source: The pseudo-subscripts need not be simple scalars.
ja: 疑似添え字は、単純なスカラーである必要はない。

source: These are extended with the same two-element list:
ja: これらは、同じ2-要素リストで広げられる：

source: An identifier may be extended with multiple named identifier extensions, in which case the names matter but their order does not.
ja: 識別子は複数の挙げられた識別子拡張で広げられるかもしれない、その場合には、名前は重要である、しかし、彼らの順序はそうしない。

source: These name the same module:
ja: これらは、同じモジュールを挙げる：

source: Adverbial syntax will be described more fully later.
ja: 副詞の構文は、後でより完全に記述される。

source: Literals
ja: リテラル

source: Perl 6 has a rich set of literal forms, many of which can be used for textual input as well.
ja: Perl 6は文字通りの形の豊かなセットを持っている。そして、それの多くが同様に原文の入力のために使われることができる。

source: For those forms simple enough to be allowed, the val() function treats such a string value as if it were a literal in the program.
ja: 許されるのに十分単純なそれらの形については、まるでそれがプログラムのリテラルであるように、val()関数はそのような文字列値を扱う。

source: In some cases the val() function will be applied on your behalf, and in other cases you must do so explicitly.
ja: 場合によっては、val()関数は代わりに適用される、そして、その他の場合、あなたははっきりとそうしなければならない。

source: The rationale for this function is that there are many cases where the programmer or user is forced to use a string type to represent a value that is intended to become a numeric type internally.
ja: この関数のための正当性は、プログラマーまたはユーザーが内部的に数値型になることを意図される値を表現するために文字列型を使うことを強制される多くのケースがあるということである。

source: Committing pre-emptively to either a string type or a numeric type is likely to be wrongish, so Perl 6 instead provides the concept of allomorphic literals.
ja: 文字列型か数値型に先買権でゆだねることはwrongishでありそうであるので、Perl 6はallomorphicなリテラルの概念をその代わりに提供する。

source: How these work is described below in &quot;Allomorphic value semantics&quot;.
ja: なんて、これらの仕事は、「Allomorphic値意味論」で後述するだろう。

source: When used as literals in a program, most of these forms produce an exact type, and are not subject to val() processing.
ja: プログラムのリテラルとして使われるとき、大部分のこれらの形は正確な型を生じて、val()処理を受けない。

source: The exceptions will be noted as we go.
ja: 我々が行って、例外は注意される。

source: Underscores
ja: アンダーライン

source: A single underscore is allowed only between any two digits in a literal number, where the definition of digit depends on the radix.
ja: 一つのアンダーラインは文字通りの数で何の間でだけでも2桁許される、そこで、桁の定義は根次第である。

source: (A single underscore is also allowed between a radix prefix and a following digit, as explained in the next section.) Underscores are not allowed anywhere else in any numeric literal, including next to the radix point or exponentiator, or at the beginning or end.
ja: （次のセクションで説明されるように、一つのアンダーラインも根接頭辞と以下の桁の間でも許される。）アンダーラインは、何か数値リテラル（基数点またはexponentiatorへの次を含む）の他のどこにも、または、始めまたは終わりで許されない。

source: Radix markers
ja: 根目印

source: Initial 0 no longer indicates octal numbers by itself.
ja: 最初の0は、単独で八進数をもはや示さない。

source: You must use an explicit radix marker for that.
ja: あなたは、それの明示的根標識を使わなければならない。

source: Pre-defined radix prefixes include:
ja: あらかじめ定義された根接頭辞は以下を含む：

source: Each of these allows an optional underscore after the radix prefix but before the first digit.
ja: これらの各々は、最初の桁の前に根接頭辞の後オプションのアンダーラインを以外許す。

source: These all mean the same thing:
ja: これらのすべては、同じものを意味する：

source: General radices
ja: 一般根

source: The general radix form of a number involves prefixing with the radix in adverbial form:
ja: 番号の一般根の形態は、副詞形で根でプレフィクシングを含む：

source: Extra digits are assumed to be represented by a..z and A..Z, so you can go up to base 36.
ja: 余分の桁はa..zによって表現されて、A..Zであるとされるので、あなたはベース36に上がることができる。

source: (Use A and B for base twelve, not T and E.) Alternately you can use a list of digits in decimal:
ja: 代わりとして、あなたは小数で桁のリストを使うことができる（ベース12、TでないとEのためにAとBを使いなさい。）：

source: All numbers representing digits must be less than the radix, or an error will result (at compile time if constant-folding can catch it, or at run time otherwise).
ja: 桁を表現しているすべての数は根より少なくなければならない、または、エラーは起こる（定数畳込みが、あるいは、さもなければ実行時で、それを捕えることができるならばコンパイル時状態にある）。

source: Any radix may include a fractional part.
ja: 何か根は、小数点部を含むかもしれない。

source: A dot is never ambiguous because you have to tell it where the number ends:
ja: あなたが数がどこで終わるかについてそれに話さなければならないので、点は決してあいまいでない：

source: Exponentials
ja: 指数関数

source: Only base 10 (in any form) allows an additional exponentiator starting with 'e' or 'E'.
ja: ベース10（どんな形でも）だけは、更なるexponentiatorが『e』または『E』から始めているのを許す。
